In [106]:
import pandas as pd

### Задание 2.3

In [107]:
customer_df = pd.DataFrame({
            'number': [0, 1, 2, 3, 4],
            'cust_id': [128, 1201, 9832, 4392, 7472],
            'cust_age': [13, 21, 19, 21, 60],
            'cust_sale': [0, 0, 0.2, 0.15, 0.3],
            'cust_year_birth': [2008, 2000, 2002, 2000, 1961],
            'cust_order': [1400, 14142, 900, 1240, 8430]
        })
display(customer_df)


import pandas as pd

def delete_columns(df, col=[]):
    try:
        return df.drop(col,axis=1)
    except KeyError:
        return None
    

display(delete_columns(customer_df, col=['cust_id']))

   number  cust_id  cust_age  cust_sale  cust_year_birth  cust_order
0       0      128        13       0.00             2008        1400
1       1     1201        21       0.00             2000       14142
2       2     9832        19       0.20             2002         900
3       3     4392        21       0.15             2000        1240
4       4     7472        60       0.30             1961        8430

   number  cust_age  cust_sale  cust_year_birth  cust_order
0       0        13       0.00             2008        1400
1       1        21       0.00             2000       14142
2       2        19       0.20             2002         900
3       3        21       0.15             2000        1240
4       4        60       0.30             1961        8430

### Задание 2.4

In [108]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'area': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

import pandas as pd

density = ((countries_df['population'] * 10**6) /
countries_df['area'])
density_mean = round(density.mean(), 2)
display(density_mean)

np.float64(84.93)

### Задание 3.4

In [109]:
ufo_df = pd.read_csv('data/ufo.csv', sep=',')
display(ufo_df.head())
display(ufo_df.tail())

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [110]:
ufo_df['Time'] = pd.to_datetime(ufo_df['Time'])
display(ufo_df.head())

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [111]:
years_ufo = ufo_df['Time'].dt.year
display(years_ufo.value_counts(normalize=True))

Time
1999    0.152075
2000    0.144455
1998    0.095554
1995    0.073680
1997    0.067814
          ...
1930    0.000110
1941    0.000110
1933    0.000055
1934    0.000055
1935    0.000055
Name: proportion, Length: 68, dtype: float64

### Задание 3.5

In [112]:
ufo_nv = ufo_df[ufo_df['State'] == 'NV']
ufo_years = ufo_nv['Time'].dt.date
ufo_diff = ufo_years.diff()
ufo_diff = ufo_diff.dt.days
ufo_diff_mean = ufo_diff.mean()
display(round(ufo_diff_mean))

69

### Задание 4.4

In [113]:
#Создали Series с опытом работы
arg = pd.Series(
    data = ['Опыт работы 8 лет 3 месяца','Опыт работы 3 года 5 месяцев', 'Опыт работы 1 год 9 месяцев', 'Опыт работы 3 месяца', 'Опыт работы 6 лет']
)
display(arg)

0      Опыт работы 8 лет 3 месяца
1    Опыт работы 3 года 5 месяцев
2     Опыт работы 1 год 9 месяцев
3            Опыт работы 3 месяца
4               Опыт работы 6 лет
dtype: object

In [142]:
#Создаем функцию для перевода опыта работы в месяцы
import pandas as pd

def get_experience(arg):
    arg_list=arg.split(' ')
    words_year_list = ['лет','год','года']
    words_month_list = ['месяца','месяцев','месяц']
    year = 0
    month = 0
    for i in range(len(arg_list)):
        if arg_list[i] in words_year_list:
            year = int(arg_list[i-1])*12
        if arg_list[i] in words_month_list:
            month = int(arg_list[i-1])
    return year + month

        
print(arg.apply(get_experience))

0    99
1    41
2    21
3     3
4    72
dtype: int64